/******************************************************************************/
/*Дана програма на вказаному проміжку [a;b] знаходить дружельбні числа. Друже-*/
/*любні числа по Піфагору такі, що кожне рівне сумі всіх дільників другого,   */
/*викльчоє саме це число. Наприклад, 220 і 284. Дільники числа 220 це 1+2+4+5+*/
/*+10+11+20+22+44+55+110=284, а сума дільників числа 284 - це 1+2+4+71+142=220*/
/******************************************************************************/

/******************************************************************************/
/*Програма призначена відшукувати дружелюбні числа на заданому проміжку. Змін-*/
/*ні призначені для: i-задання проміжку заданих чисел; j-знаходнення дільників*/
/*чисел і; n-додавання дільників числа і; w-знаходження дільників числа n; m- */
/*додавання дільників числа n. На екран відбувається виведення речення "Dano  */
/*chisla ot 30 do 8000 z nuh druzestvenni:" та знового рядка в стовпчик    */
/*шукані числа. Програма працює 5 секунд. Програма потребує пам'яті на диску: */
/*2,62 МБ (2 756 608 байт)та 4488 Кб оперативної пам'яті. Програму створив    */
/*Котлубаєв М.Є. 21.01.2009 р.                                                */
/******************************************************************************/

#include <iostream.h>
#include <conio.h>
#include <math.h>
void main()
{
 int i,j,n,w,m;
 cout<<"Dano chisla ot 30 do 8000 z nuh druzestvenni: \n";
 for (i=30;i<=8000;i++) // Беруться числа від 30 до 8000
 {
  n=0;
  m=0;
  for (j=1;j<i;j++)          // Знаходження дільників обраного числа
  if (fmod(i,j)==0) n+=j;    // Додавання дальників
  for (w=1;w<n;w++)          // Знаходження дільників отриманого числа
  if (fmod(n,w)==0) m+=w;    // Додавання дальників
  if (i==m) cout<<i<<"\n";   // Якщо число дружелюбне, воно виводиться на екран
 }
 getch();
}
